/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_bzero.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sdanzanr <sdanzanr@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/04/27 17:49:33 by sdanzanr          #+#    #+#             */
/*   Updated: 2024/04/28 07:16:46 by sdanzanr         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
#include <unistd.h>

/*ここではポインタの概念を復習した.
＊（アスタリスク）は住所の中身を指してる。
str++;に＊（アスタリスク）を付けてない理由は次のメモリアドレスを指すため*/

void	ft_bzero(void *s, size_t n)
{
	size_t	i;

	i = 0;
	while (i < n)
	{
		((char *)s)[i] = 0;
		i++;
	}
}

int main(void)
{
    char str[] = "0123456789";
	ft_bzero(str, 1);
	printf("%s\n", str);
    return 0;
}
